ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/base/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application simpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 6000;

deltaT 1.0;

adjustTimeStep no;
maxCo 0.9;

writeControl timeStep;

writeInterval 100;

purgeWrite 3;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
  continuityError1
  {
    type continuityError;
    libs
      (
        fieldFunctionObjects
      ); 	// Mandatory entries (unmodifiable)// Optional entries (runtime modifiable)
    phi phi; 	// Optional (inherited) entries
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    log yes;
    timeStart 0;
    timeEnd 6000;
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 50;
  }
  residuals
  {
    type solverInfo;
    libs
      (
        "libutilityFunctionObjects.so"
      );
    fields
      (
        ".*"
      );
  }
  fieldMinMax1
  {
    type fieldMinMax;
    libs
      (
        fieldFunctionObjects
      ); 	// Mandatory entries (unmodifiable)// Mandatory entries (runtime modifiable)
    mode magnitude;
    fields
      (
        U
        p
      ); 	// Optional entries (runtime modifiable)
    location yes;
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    log yes;
    timeStart 0;
    timeEnd 8000;
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 100;
  }
  yPlus1
  {
    type yPlus;
    libs
      (
        fieldFunctionObjects
      ); 	// Mandatory entries (unmodifiable)// Optional (inherited) entries
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    log yes;
    timeStart 0;
    timeEnd 8000;
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 100;
  }
  inletFlux
  {
    type surfaceFieldValue;
    libs
      (
        "libfieldFunctionObjects.so"
      );
    writeControl timeStep;
    log yes;
    writeFields no;
    regionType patch;
    name floodoutlet_vol_2-3_0;
    operation sum;
    fields
      (
        phi
      ); 	// Optional (inherited) entries
    writePrecision 8;
    writeToFile yes;
    useUserTime yes;
    region region0;
    enabled yes;
    timeStart 0;
    timeEnd 8000;
    executeControl timeStep;
    executeInterval 1;
    writeInterval 100;
  }
}

