ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/base/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object blockMeshDict;
}

scale 1;

vertices ;

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (10 55 10)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

patches
  (
  );

mergePatchPairs
  (
  );

