ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/base/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object snappyHexMeshDict;
}

castellatedMesh yes;
snap yes;
addLayers yes;
geometry
{
  model_m.stl
  {
    type triSurfaceMesh;
    name model;
    regions
    {
    }
  }
}

castellatedMeshControls
{
  features
    (

      {
        file "model_typeB_m.eMesh";
        level 4;

      }
    );
  refinementSurfaces
  {
    model
    {
      level
        (
          0
          0
        );
      regions
      {
       
      }
    }
  }
  refinementRegions
  {
  }
  locationInMesh (-1.9 1.0 0.1);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces no;
}

snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}

addLayersControls
{
  layers
  {
  }
  relativeSizes yes;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  // featureAngle 60;
  featureAngle 130;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedialAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}

meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1e-13;
  minTetQuality -1e+30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}

debug 0;

mergeTolerance 1e-05;

