ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object blockMeshDict;
}

scale 1;

vertices
  (

(-0.01 -0.01 -0.01)
(0.51 -0.01 -0.01)
(0.51 0.91 -0.01)
(-0.01 0.91 -0.01)
(-0.01 -0.01 0.22)
(0.51 -0.01 0.22)
(0.51 0.91 0.22)
(-0.01 0.91 0.22)  );

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (13 23 5)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

patches
  (
  );

mergePatchPairs
  (
  );

