ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/createPatchDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object createPatchDict;
}

pointSync no;
patches
  (

    {
      name defalt;
      patchInfo
      {
        type wall;
      }
      constructFrom patches;
      patches
        (
          ".*"
        );

    }

    {
      constructFrom patches;
      name TopSideWall_wall_2-3_3;
      patchInfo
      {
        type patch;
      }
      patches
        (
          oldInternalFaces
        );

    }
  );

