ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object snappyHexMeshDict;
}

castellatedMesh yes;
snap yes;
addLayers yes;
geometry
{
  model_m.stl
  {
    type triSurfaceMesh;
    name model;
    regions
    {
      floodOutlet_press_2-4_0
      {
        name floodOutlet_press_2-4_0;
      }
      topSlip_slip_2-4_3
      {
        name topSlip_slip_2-4_3;
      }
      maintankInlet_vol_2-4_0
      {
        name maintankInlet_vol_2-4_0;
      }
      tempOutlet_vol_3-6_0
      {
        name tempOutlet_vol_3-6_0;
      }
      pumpOutlet_vol_2-4_0
      {
        name pumpOutlet_vol_2-4_0;
      }
      tempInlet_vol_3-6_0
      {
        name tempInlet_vol_3-6_0;
      }
      underWall_wall_2-4_3
      {
        name underWall_wall_2-4_3;
      }
      mainWall_wall_2-4_0
      {
        name mainWall_wall_2-4_0;
      }
      floodinWallhate_wall_2-4_3
      {
        name floodinWallhate_wall_2-4_3;
      }
      floodWal_wall_2-4_3
      {
        name floodWal_wall_2-4_3;
      }
      pumpinWallheat_wall_2-4_0
      {
        name pumpinWallheat_wall_2-4_0;
      }
      tempoutWal_wall_3-6_0
      {
        name tempoutWal_wall_3-6_0;
      }
      pumpWall_wall_2-4_0
      {
        name pumpWall_wall_2-4_0;
      }
      tempInWall_wall_3-6_0
      {
        name tempInWall_wall_3-6_0;
      }
    }
  }
}

castellatedMeshControls
{
  features
    (

      {
        file model_m.eMesh;
        level 4;

      }
    );
  refinementSurfaces
  {
    model
    {
      level
        (
          0
          0
        );
      regions
      {
        floodOutlet_press_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type patch;
          }
        }
        topSlip_slip_2-4_3
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        maintankInlet_vol_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type patch;
          }
        }
        tempOutlet_vol_3-6_0
        {
          level
            (
              2
              5
            );
          patchInfo
          {
            type patch;
          }
        }
        pumpOutlet_vol_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type patch;
          }
        }
        tempInlet_vol_3-6_0
        {
          level
            (
              2
              5
            );
          patchInfo
          {
            type patch;
          }
        }
        underWall_wall_2-4_3
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        mainWall_wall_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        floodinWallhate_wall_2-4_3
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        floodWal_wall_2-4_3
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        pumpinWallheat_wall_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        tempoutWal_wall_3-6_0
        {
          level
            (
              2
              5
            );
          patchInfo
          {
            type wall;
          }
        }
        pumpWall_wall_2-4_0
        {
          level
            (
              2
              4
            );
          patchInfo
          {
            type wall;
          }
        }
        tempInWall_wall_3-6_0
        {
          level
            (
              2
              5
            );
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
  }
  locationInMesh (0.005 0.005 0.005);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces no;
}

snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}

addLayersControls
{
  layers
  {
    floodOutlet_press_2-4_0
    {
      nSurfaceLayers 0;
    }
    topSlip_slip_2-4_3
    {
      nSurfaceLayers 3;
    }
    maintankInlet_vol_2-4_0
    {
      nSurfaceLayers 0;
    }
    tempOutlet_vol_3-6_0
    {
      nSurfaceLayers 0;
    }
    pumpOutlet_vol_2-4_0
    {
      nSurfaceLayers 0;
    }
    tempInlet_vol_3-6_0
    {
      nSurfaceLayers 0;
    }
    underWall_wall_2-4_3
    {
      nSurfaceLayers 3;
    }
    mainWall_wall_2-4_0
    {
      nSurfaceLayers 0;
    }
    floodinWallhate_wall_2-4_3
    {
      nSurfaceLayers 3;
    }
    floodWal_wall_2-4_3
    {
      nSurfaceLayers 3;
    }
    pumpinWallheat_wall_2-4_0
    {
      nSurfaceLayers 0;
    }
    tempoutWal_wall_3-6_0
    {
      nSurfaceLayers 0;
    }
    pumpWall_wall_2-4_0
    {
      nSurfaceLayers 0;
    }
    tempInWall_wall_3-6_0
    {
      nSurfaceLayers 0;
    }
  }
  relativeSizes yes;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1; 	// featureAngle 60;
  featureAngle 130;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedialAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}

meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1e-13;
  minTetQuality -1e+30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}

debug 0;

mergeTolerance 1e-05;

