ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location 0;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0.1 0 0);

boundaryField
{
  ".*"
  {
    type fixedValue;
    value uniform (0 0 0);
  }
  inteOutlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         -0.0025666666666666667 ;
  }
  pumpOutlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         -0.003 ;
  }
  throughOutlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0 ;
  }
  floodOutlet_press_2-4_0
  {
    type pressureInletOutletVelocity;
    value uniform (0 0 0);
  }
  workheadOutlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0 ;
  }
  workbaseOutlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0 ;
  }
  tankInlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.0001833333333333333 ;
  }
  cylclone1Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.0015 ;
  }
  cylclone2Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.0015 ;
  }
  nozlel1Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel2Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel3Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel4Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel5Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel6Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel7Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel8Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel9Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel10Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  nozlel11Inlet_vol_2-4_0
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         0.00021666666666666666 ;
  }
  topSlip_slip_2-4_3
  {
    type slip;
  }
}

