ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location 0;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0.1 0 0);

boundaryField
{
    ".*"
    {
    type fixedValue;
    value uniform (0 0 0);
  }

}

