ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object p;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.0;

boundaryField
{
  ".*"
  {
    type zeroGradient;
  }
}

