ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object p;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.0;

boundaryField
{
  ".*"
  {
    type zeroGradient;
  }
  inteOutlet_vol_2-4_0
  {
    type zeroGradient;
  }
  pumpOutlet_vol_2-4_0
  {
    type zeroGradient;
  }
  throughOutlet_vol_2-4_0
  {
    type zeroGradient;
  }
  floodOutlet_press_2-4_0
  {
    p0 uniform 0;
    type totalPressure;
    value uniform 0;
  }
  workheadOutlet_vol_2-4_0
  {
    type zeroGradient;
  }
  workbaseOutlet_vol_2-4_0
  {
    type zeroGradient;
  }
  tankInlet_vol_2-4_0
  {
    type zeroGradient;
  }
  cylclone1Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  cylclone2Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel1Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel2Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel3Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel4Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel5Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel6Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel7Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel8Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel9Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel10Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  nozlel11Inlet_vol_2-4_0
  {
    type zeroGradient;
  }
  topSlip_slip_2-4_3
  {
    type zeroGradient;
  }
}

