ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/epsilon
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object epsilon;
}

dimensions [ 0 2 -3 0 0 0 0 ];

internalField uniform 0.001;

boundaryField
{
  ".*"
  {
    type epsilonWallFunction;
    value uniform 0;
  }
  floodoutlet_vol_2-3_0
  {
    inletValue $internalField;
    type inletOutlet;
    value $internalField;
  }
  tankinlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  nozleoutlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  ADFinlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  tempoutlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  tempinlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  dirtyoutlet_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  nozleinlet2_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  nozleinlet1_vol_2-3_0
  {
    type fixedValue;
    value $internalField;
  }
  model_Face068
  {
    type zeroGradient;
  }
}

