ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object k;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.001;

boundaryField
{
  ".*"
  {
    type kqRWallFunction;
    value uniform 0;
  }
}

