ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0.001;

boundaryField
{
  ".*"
  {
    type nutkWallFunction;
    value uniform 0;
  }
}

