ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/base/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField uniform 5.6;//I=0.05,k=3/2(IU)^2, omega=k^0.5/(Cnu^0.25*L),L=20

boundaryField
{
    ".*"
  {
    type omegaWallFunction;
    value uniform 0;
  }
}

