ana002_buoyantPimple_circleTempRoughMesh_001/mesh/0/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location 0;
 object omega;
}

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform 5.6; 	//I=0.05,k=3/2(IU)^2, omega=k^0.5/(Cnu^0.25*L),L=20

boundaryField
{
  ".*"
  {
    type omegaWallFunction;
    value uniform 0;
  }
  inteOutlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  pumpOutlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  throughOutlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  floodOutlet_press_2-4_0
  {
    inletValue $internalField;
    type inletOutlet;
    value $internalField;
  }
  workheadOutlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  workbaseOutlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  tankInlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  cylclone1Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  cylclone2Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel1Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel2Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel3Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel4Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel5Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel6Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel7Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel8Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel9Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel10Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  nozlel11Inlet_vol_2-4_0
  {
    type fixedValue;
    value $internalField;
  }
  topSlip_slip_2-4_3
  {
    type zeroGradient;
  }
}

