ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
solvers{
    p{
        solver PCG;
        preconditioner DIC;
        tolerance 1e-07;
        relTol 0.01;
    }
    U{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    k{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-06;
        relTol 0.1;
    }
    omega{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-06;
        relTol 0.1;
    }
    //epsilon{
    //    solver PBiCG;
    //    preconditioner DILU;
    //   tolerance 1e-06;
    //    relTol 0.1;
    //}
    tracer{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
}
SIMPLE{
    nNonOrthogonalCorrectors 1;
    residualControl{
        p 0.01;
        U 0.001;
        k 0.001;
        //epsilon 0.001;
        omega 0.001;
        tracer 0.001;
    }
}
relaxationFactors{
    fields{
        p 0.01;
    }
    equations{
        U 0.1;
        k 0.1;
        //epsilon 0.1;
        omega 0.1;
        tracer 0.3;
    }
}
