ana002_buoyantPimple_circleTempRoughMesh_001/mesh/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
numberOfSubdomains 8;
method scotch;
